In [39]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [40]:
xls = pd.ExcelFile('Report_excel.xlsx')
df = pd.read_excel(xls, 'Isoflavo',usecols = ['No.','Name', 'Acarbose.2', 'Test.2','Acarbose.3','Test.3'])
df.columns = ['No','Name', '2.Acarbose (AG)', '1.Test (AG)', '4.Acarbose (AM)', '3.Test (AM)']
#df = pd.read_excel(xls, 'Flavan-3-ol', usecols = ['Name', 'SMILES_standardized', 'Ratio', 'Ratio.1'])

In [41]:
df['Name'] = df['Name'].fillna(method='ffill')
df['No'] = df['No'].fillna(method='ffill')
df.head(25)

,No,Name,2.Acarbose (AG),1.Test (AG),4.Acarbose (AM),3.Test (AM)
0,159.0,Genistein,2.800000,0.165510,10.0,1.39436
1,159.0,Genistein,0.590000,642.210000,NaN,NaN
2,159.0,Genistein,425.000000,29.900000,NaN,NaN
3,159.0,Genistein,48.043542,3.702979,NaN,NaN
4,159.0,Genistein,671.400000,257.300000,89.3,110.40000
5,159.0,Genistein,144.260000,2.370000,NaN,NaN
6,159.0,Genistein,51.320000,50.050000,NaN,NaN
7,159.0,Genistein,336.304794,274.020464,NaN,NaN
8,160.0,Formononetin,2.800000,0.506200,10.0,0.62264
9,160.0,Formononetin,0.590000,747.830000,NaN,NaN
10,160.0,Formononetin,382.000000,27.000000,NaN,NaN
11,161.0,Dalbergioidin,671.400000,412.600000,89.3,162.80000
12,162.0,Puerarin,124.200000,75.600000,NaN,NaN
13,162.0,Puerarin,1998.790000,524.080000,NaN,NaN
14,162.0,Puerarin,NaN,NaN,5.3,394.20000
15,162.0,Puerarin,785.000000,107.000000,NaN,NaN
16,162.0,Puerarin,144.260000,147.300000,NaN,NaN
17,162.0,Puerarin,175.840000,195.550000,NaN,NaN

# Melt

In [42]:
df_melted = df.melt(id_vars=['No','Name'], value_vars=['2.Acarbose (AG)', '1.Test (AG)', '4.Acarbose (AM)', '3.Test (AM)'])

In [43]:
df_melted.dropna(inplace = True)
df_melted.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 44 entries, 0 to 68
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   No        44 non-null     float64
 1   Name      44 non-null     object
 2   variable  44 non-null     object
 3   value     44 non-null     float64
dtypes: float64(2), object(2)
memory usage: 1.7+ KB

In [44]:
df_melted['real_value'] = df_melted['value']*(10**(-6))
df_melted['log'] = df_melted['real_value'].apply(lambda x: -np.log10(x)) 
df_melted.drop('value', inplace=True, axis=1)
df_melted.drop('real_value', inplace=True, axis=1)
df_melted.head()

      No       Name         variable       log
0  159.0  Genistein  2.Acarbose (AG)  5.552842
1  159.0  Genistein  2.Acarbose (AG)  6.229148
2  159.0  Genistein  2.Acarbose (AG)  3.371611
3  159.0  Genistein  2.Acarbose (AG)  4.318365
4  159.0  Genistein  2.Acarbose (AG)  3.173019

In [45]:
def q25(x):
    return x.quantile(0.25)


def q75(x):
    return x.quantile(0.75)

In [46]:
df_result=df_melted.groupby(['No','Name','variable']).agg({'log':[np.median,'count',q25,q75]})

In [47]:
df_result.to_excel('Isoflavonoid.xlsx')